#include "Tile.h"

std::map<int, sf::IntRect> Tile::tileMapping = {
    {0, sf::IntRect(32, 0, 16, 16)},    // Лівий верхній край стіни
    {1, sf::IntRect(48, 0, 16, 16)},    // Середній верхній край стіни
    {2, sf::IntRect(64, 0, 16, 16)},    // Правий верхній край стіни
    {3, sf::IntRect(32, 16, 16, 16)},   // Лівий середній край стіни
    {4, sf::IntRect(48, 16, 16, 16)},   // Середній стіни
    {5, sf::IntRect(64, 16, 16, 16)},   // Правий середній край стіни
    {6, sf::IntRect(32, 32, 16, 16)},   // Лівий нижній край стіни
    {7, sf::IntRect(48, 32, 16, 16)},   // Середній нижній край стіни
    {8, sf::IntRect(64, 32, 16, 16)},   // Правий нижній край стіни
    {9, sf::IntRect(0, 48, 16, 16)},    // Ліва банер
    {10, sf::IntRect(16, 48, 16, 16)},  // Права банер
    {11, sf::IntRect(32, 48, 16, 16)},  // Горизонтальна балка
    {12, sf::IntRect(48, 48, 16, 16)},  // Вертикальна балка
    {13, sf::IntRect(64, 48, 16, 16)},  // Бочка
    {14, sf::IntRect(0, 64, 16, 16)},   // Факел
    {15, sf::IntRect(16, 64, 16, 16)},  // Розколота підлога
    {16, sf::IntRect(32, 64, 16, 16)},  // Звичайна підлога
    {17, sf::IntRect(48, 64, 16, 16)},  // Відкриті двері зверху
    {18, sf::IntRect(64, 64, 16, 16)},  // Закриті двері
    {19, sf::IntRect(0, 80, 16, 16)},   // Ліва половина статуї
    {20, sf::IntRect(16, 80, 16, 16)},  // Права половина статуї
    {21, sf::IntRect(32, 80, 16, 16)},  // Порожній ящик
    {22, sf::IntRect(48, 80, 16, 16)},  // Заповнений ящик
    {23, sf::IntRect(64, 80, 16, 16)},  // Верхній край стовпа
    {24, sf::IntRect(0, 96, 16, 16)},   // Нижній край стовпа
    {25, sf::IntRect(16, 96, 16, 16)},  // Сходи
    {26, sf::IntRect(32, 96, 16, 16)},  // Камінці
    {27, sf::IntRect(48, 96, 16, 16)},  // Зруйнована стіна
    {28, sf::IntRect(64, 96, 16, 16)},  // Зруйнована підлога
    {29, sf::IntRect(0, 112, 16, 16)},  // Кам’яна підлога
    {30, sf::IntRect(16, 112, 16, 16)}  // Плитка підлоги
};

Tile::Tile()
    : id(-1), texture(nullptr) {
    // Якщо потрібно, можна додати додаткову ініціалізацію
}

Tile::Tile(int id, sf::Texture* texture)
    : id(id), texture(texture) {
    if (tileMapping.find(id) != tileMapping.end()) {
        rect = tileMapping[id];
        sprite.setTexture(*texture);
        sprite.setTextureRect(rect);  // Встановлюємо прямокутник текстури
    }
}

sf::Sprite Tile::getSprite() const {
    return sprite;
}
int Tile::getId() const {
    return id;
}

bool Tile::isEmpty() const {
    return id == -1; // Вважаємо, що тайл з id -1 є порожнім
}